app/controllers/users_controller.rb

    def index
        all_users=User.all
---
SELECT "users".* FROM "users"